Revit 2027 API
Document.SaveAs Method
Overload List
Name | Description
SaveAs(String) |  Saves the document to a given file path.
SaveAs(ModelPath, SaveAsOptions) |  Saves the document to a given path.
SaveAs(String, SaveAsOptions) |  Saves the document to a given file path.
Top
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace